## Pandas
pandas is an open source Python library for data analysis. Python has always been great for prepping and munging data, but it's never been great for analysis - you'd usually end up using R or loading it into a database and using SQL (or worse, Excel). pandas makes Python great for analysis.

## Data Structures
pandas introduces two new data structures to Python - Series and DataFrame, both of which are built on top of NumPy (this means it's fast).

In [1]:
import pandas as pd
import numpy as np
pd.set_option('max_columns', 50)

## Series
A Series is a one-dimensional object similar to an array, list, or column in a table. It will assign a labeled index to each item in the Series. By default, each item will receive an index label from 0 to N, where N is the length of the Series minus one.

In [2]:
# create a Series with an arbitrary list
s = pd.Series([7, 'Heisenberg', 3.14, -1789710578, 'Happy Eating!'])
s

0                7
1       Heisenberg
2             3.14
3      -1789710578
4    Happy Eating!
dtype: object

Alternatively, you can specify an index to use when creating the Series.

In [3]:
s = pd.Series([7, 'Heisenberg', 3.14, -1789710578, 'Happy Eating!'],
              index=['A', 'Z', 'C', 'Y', 'E'])
s

A                7
Z       Heisenberg
C             3.14
Y      -1789710578
E    Happy Eating!
dtype: object

The Series constructor can convert a dictonary as well, using the keys of the dictionary as its index.

In [5]:
d = {'Chicago': 1000, 'New York': 1300, 'Portland': 900, 'San Francisco': 1100,
     'Austin': 450, 'Boston': None}
cities = pd.Series(d)
cities

Chicago          1000.0
New York         1300.0
Portland          900.0
San Francisco    1100.0
Austin            450.0
Boston              NaN
dtype: float64

You can use the index to select specific items from the Series ...

In [7]:
# Get just Chicago
cities['Chicago']

1000.0

In [9]:
# Get Chicago, Portland & San Francisco
cities[['Chicago','Portland','San Francisco']] # Havta give double brackets - think why!

Chicago          1000.0
Portland          900.0
San Francisco    1100.0
dtype: float64

Or you can use boolean indexing for selection.

In [10]:
# Just get cities with less than 1000
cities[cities < 1000]

Portland    900.0
Austin      450.0
dtype: float64

That last one might be a little weird, so let's make it more clear - cities < 1000 returns a Series of True/False values, which we then pass to our Series cities, returning the corresponding True items.

In [11]:
less_than_1000 = cities < 1000 # This & next code code will give boolean test results (True/False types!)
print(less_than_1000)
print('\n')
print(cities[less_than_1000]) # This will onlt print the cities that satisfy the Boolean test, i.e., for which test gives 'True'

Chicago          False
New York         False
Portland          True
San Francisco    False
Austin            True
Boston           False
dtype: bool


Portland    900.0
Austin      450.0
dtype: float64

You can also change the values in a Series on the fly.

In [12]:
# changing based on the index
print('Old value:', cities['Chicago'])

print('New value:', cities['Chicago'])

Old value: 1000.0
New value: 1000.0

In [ ]:
# changing values using boolean logic
print(cities[cities < 1000])
print('\n')

print(cities[cities < 1000])

What if you aren't sure whether an item is in the Series? You can check using idiomatic Python.

In [ ]:
# Check if Seattle in the city list
print('Seattle' in cities)
# Check if San Francisco in the city list

Mathematical operations can be done using scalars and functions.

In [ ]:
# divide city values by 3
cities / 3

In [ ]:
# square city values

NULL checking can be performed with isnull and notnull.

In [ ]:
# use boolean logic to grab the NULL cities
print(cities.isnull())
print('\n')

## DataFrame
A DataFrame is a tablular data structure comprised of rows and columns, akin to a spreadsheet, database table, or R's data.frame object. You can also think of a DataFrame as a group of Series objects that share an index (the column names).

## Reading Data
To create a DataFrame out of common Python data structures, we can pass a dictionary of lists to the DataFrame constructor.

Using the columns parameter allows us to tell the constructor how we'd like the columns ordered. By default, the DataFrame constructor will order the columns alphabetically (though this isn't the case when reading from a file - more on that next).

In [ ]:
data = {'year': [2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012],
        'team': ['Bears', 'Bears', 'Bears', 'Packers', 'Packers', 'Lions', 'Lions', 'Lions'],
        'wins': [11, 8, 10, 15, 11, 6, 10, 4],
        'losses': [5, 8, 6, 1, 5, 10, 6, 12]}
football = pd.DataFrame(data, columns=['year', 'team', 'wins', 'losses'])
football

## CSV

Reading a CSV is as simple as calling the read_csv function. By default, the read_csv function expects the column separator to be a comma, but you can change that using the sep parameter.

In [ ]:
from_csv = pd.read_csv('mariano-rivera.csv')
from_csv.head()

Our file had headers, which the function inferred upon reading in the file. Had we wanted to be more explicit, we could have passed header=None to the function along with a list of column names to use:

## Working with DataFrames
Now that we can get data into a DataFrame, we can finally start working with them. pandas has an abundance of functionality, far too much for me to cover in this introduction. I'd encourage anyone interested in diving deeper into the library to check out its excellent documentation. Or just use Google - there are a lot of Stack Overflow questions and blog posts covering specifics of the library.

We'll be using the MovieLens dataset in many examples going forward. The dataset contains 100,000 ratings made by 600 users on 9,000 movies.

In [ ]:
# pass in column names for each CSV
u_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']

r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']

# the movies file contains columns indicating the movie's genres
# let's only load the first five columns of the file with usecols
m_cols = ['movie_id', 'title', 'release_date', 'video_release_date', 'imdb_url']
movies = pd.read_csv('movies.csv', names=m_cols, usecols=range(5))

## Inspection
pandas has a variety of functions for getting basic information about your DataFrame, the most basic of which is using the info method.

In [ ]:
movies.info()

The output tells a few things about our DataFrame.

It's obviously an instance of a DataFrame.
Each row was assigned an index of 0 to N-1, where N is the number of rows in the DataFrame. pandas will do this by default if an index is not specified. Don't worry, this can be changed later.
There are 1,682 rows (every row must have an index).
Our dataset has five total columns, one of which isn't populated at all (video_release_date) and two that are missing some values (release_date and imdb_url).
The last datatypes of each column, but not necessarily in the corresponding order to the listed columns. You should use the dtypes method to get the datatype for each column.
An approximate amount of RAM used to hold the DataFrame. See the .memory_usage method

DataFrame's also have a describe method, which is great for seeing basic statistics about the dataset's numeric columns. Be careful though, since this will return information on all columns of a numeric datatype.

We can quickly see the average age of our users is just above 34 years old, with the youngest being 7 and the oldest being 73. The median age is 31, with the youngest quartile of users being 25 or younger, and the oldest quartile being at least 43.

You've probably noticed that I've used the head method regularly throughout this post - by default, head displays the first five records of the dataset, while tail displays the last five.

Use the .unique() function to get all the unique entries in a column

## Selecting
You can think of a DataFrame as a group of Series that share an index (in this case the column headers). This makes it easy to select specific columns.

Selecting a single column from the DataFrame will return a Series object.

In [ ]:
users['occupation'].head()

To select multiple columns, simply pass a list of column names to the DataFrame, the output of which will be a DataFrame.

In [ ]:
print(users[['age', 'zip_code']].head())
print('\n')

# can also store in a variable to use later
columns_you_want = ['occupation', 'gender']

Row selection can be done multiple ways, but doing so by an individual index or boolean indexing are typically easiest.

In [ ]:
# users older than 25

print('\n')

# users aged 40 AND male

print('\n')

# users younger than 30 OR female

## Joining
Throughout an analysis, we'll often need to merge/join datasets as data is typically stored in a relational manner.

Our MovieLens data is a good example of this - a rating requires both a user and a movie, and the datasets are linked together by a key - in this case, the user_id and movie_id. It's possible for a user to be associated with zero or many ratings and movies. Likewise, a movie can be rated zero or many times, by a number of different users.

Like SQL's JOIN clause, pandas.merge allows two DataFrames to be joined on one or more keys. The function provides a series of parameters (on, left_on, right_on, left_index, right_index) allowing you to specify the columns or indexes on which to join.

By default, pandas.merge operates as an inner join, which can be changed using the how parameter.

In [ ]:
# create one merged DataFrame
movie_ratings = pd.merge(
lens = pd.merge(
lens.head()

## Grouping
Grouping in pandas can taks some time to grasp, but it's pretty awesome once it clicks.

pandas groupby method draws largely from the split-apply-combine strategy for data analysis. If you're not familiar with this methodology, I highly suggest you read up on it. It does a great job of illustrating how to properly think through a data problem, which I feel is more important than any technical skill a data analyst/scientist can possess.

When approaching a data analysis problem, you'll often break it apart into manageable pieces, perform some operations on each of the pieces, and then put everything back together again (this is the gist split-apply-combine strategy). pandas groupby is great for these problems (R users should check out the plyr and dplyr packages).

If you've ever used SQL's GROUP BY or an Excel Pivot Table, you've thought with this mindset, probably without realizing it.

We can use this to find the counts of reviews by each movie:

In [ ]:
lens.groupby('title').size()

Now lets take this data and use it to find the top 50 most reviewed movies. We're splitting the DataFrame into groups by movie title and applying the size method to get the count of records in each group. Next we need to order our results in descending order and limit the output to the top 50 using Python's slicing syntax.

In SQL, this would be equivalent to:

SELECT title, count(1)  
FROM lens  
GROUP BY title  
ORDER BY 2 DESC  
LIMIT 50;

In [ ]:
most_rated = lens.groupby(
most_rated.head()

## Pivoting
### Which movies do men and women most disagree on?
Think about how you'd have to do this in SQL for a second. You'd have to use a combination of IF/CASE statements with aggregate functions in order to pivot your dataset. Your query would look something like this:

SELECT title, AVG(IF(sex = 'F', rating, NULL)), AVG(IF(sex = 'M', rating, NULL))
FROM lens
GROUP BY title;

Imagine how annoying it'd be if you had to do this on more than two columns.

DataFrame's have a pivot_table method that makes these kinds of operations much easier (and less verbose).

In [ ]:
lens.reset_index('movie_id', inplace=True)

In [ ]:
pivoted = lens.pivot_table(index=['movie_id', 'title'], # Movie id and corresponding title will come row-wise
                           columns=['gender'], # Gender - will have 2 columns for M & F 
                           values='rating', # Value will be movie ratings for each movie by gender
                           fill_value=0) # So if there's a missing rating, it will fill it to be equal to 0
pivoted.head()

Next, calculate a difference column

In [ ]:
pivoted['diff'] = pivoted.M - pivoted.F
pivoted.head()

Finally just limit to top 50 movies and sort by our difference column

In [ ]:
pivoted.reset_index('movie_id', inplace=True)

In [ ]:
disagreements = pivoted[pivoted.movie_id.isin(most_50.index)]['diff'].sort_values() # Saying that if the movie-id feild of the pivoted table is in most-50 rates index created above, then we wanna keep it and look at the diff frame and sort it!
disagreements

# Homework
## Undergrads & Grads

Provide the code to read in the global COVID-19 cases, death and recovery time-series data into three separate DataFrames.

In [13]:
# reading 3 separate dataframes
# cases dataframe
df_cases = pd.read_csv('time_series_covid19_confirmed_global_long - Copy.csv')
df_cases.head()

  Province/State Country/Region       Lat       Long       Date  Confirmed
0            NaN    Afghanistan  33.93911  67.709953  1/22/2020          0
1            NaN        Albania  41.15330  20.168300  1/22/2020          0
2            NaN        Algeria  28.03390   1.659600  1/22/2020          0
3            NaN        Andorra  42.50630   1.521800  1/22/2020          0
4            NaN         Angola -11.20270  17.873900  1/22/2020          0

In [14]:
# death dataframe
df_death = pd.read_csv('time_series_covid19_deaths_global_long - Copy.csv')
df_death.head()

  Province/State Country/Region       Lat       Long       Date  Deaths
0            NaN    Afghanistan  33.93911  67.709953  1/22/2020       0
1            NaN        Albania  41.15330  20.168300  1/22/2020       0
2            NaN        Algeria  28.03390   1.659600  1/22/2020       0
3            NaN        Andorra  42.50630   1.521800  1/22/2020       0
4            NaN         Angola -11.20270  17.873900  1/22/2020       0

In [16]:
# recovery dataframe
df_recovery = pd.read_csv('time_series_covid19_recovered_global_long - Copy.csv')
df_recovery.head()

  Province/State Country/Region       Lat       Long       Date  Recovered
0            NaN    Afghanistan  33.93911  67.709953  1/22/2020          0
1            NaN        Albania  41.15330  20.168300  1/22/2020          0
2            NaN        Algeria  28.03390   1.659600  1/22/2020          0
3            NaN        Andorra  42.50630   1.521800  1/22/2020          0
4            NaN         Angola -11.20270  17.873900  1/22/2020          0

How many rows are present in each DataFrame?

In [20]:
# Length of rows in Cases dataframe
len(df_cases)

171585

In [21]:
# Length of rows in deaths dataframe
len(df_death)

171585

Print the name of all the columns in the Cases DataFrame

In [22]:
# Length of rows in recovery dataframe
len(df_recovery)

162360

Show the last 10 rows of the confirmed cases DataFrame

In [23]:
df_cases.tail(10)

,Province/State,Country/Region,Lat,Long,Date,Confirmed
171575,NaN,United Kingdom,55.378100,-3.436000,9/27/2021,7701715
171576,NaN,Uruguay,-32.522800,-55.765800,9/27/2021,388572
171577,NaN,Uzbekistan,41.377491,64.585262,9/27/2021,172493
171578,NaN,Vanuatu,-15.376700,166.959200,9/27/2021,4
171579,NaN,Venezuela,6.423800,-66.589700,9/27/2021,363300
171580,NaN,Vietnam,14.058324,108.277199,9/27/2021,766051
171581,NaN,West Bank and Gaza,31.952200,35.233200,9/27/2021,398946
171582,NaN,Yemen,15.552727,48.516388,9/27/2021,8988
171583,NaN,Zambia,-13.133897,27.849332,9/27/2021,208867
171584,NaN,Zimbabwe,-19.015438,29.154857,9/27/2021,129919

Print a list of unique countries/regions in the deaths data.

In [24]:
cr_death = df_death['Country/Region']
print(np.unique(cr_death).tolist())

['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola', 'Antigua and Barbuda', 'Argentina', 'Armenia', 'Australia', 'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh', 'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bhutan', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil', 'Brunei', 'Bulgaria', 'Burkina Faso', 'Burma', 'Burundi', 'Cabo Verde', 'Cambodia', 'Cameroon', 'Canada', 'Central African Republic', 'Chad', 'Chile', 'China', 'Colombia', 'Comoros', 'Congo (Brazzaville)', 'Congo (Kinshasa)', 'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Cyprus', 'Czechia', 'Denmark', 'Diamond Princess', 'Djibouti', 'Dominica', 'Dominican Republic', 'Ecuador', 'Egypt', 'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia', 'Eswatini', 'Ethiopia', 'Fiji', 'Finland', 'France', 'Gabon', 'Gambia', 'Georgia', 'Germany', 'Ghana', 'Greece', 'Grenada', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Guyana', 'Haiti', 'Holy See', 'Honduras', 'Hungary', 'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy', 'Jamaica', 'Japan', 'Jordan', 'Kazakhstan', 'Kenya', 'Kiribati', 'Korea, South', 'Kosovo', 'Kuwait', 'Kyrgyzstan', 'Laos', 'Latvia', 'Lebanon', 'Lesotho', 'Liberia', 'Libya', 'Liechtenstein', 'Lithuania', 'Luxembourg', 'MS Zaandam', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives', 'Mali', 'Malta', 'Marshall Islands', 'Mauritania', 'Mauritius', 'Mexico', 'Micronesia', 'Moldova', 'Monaco', 'Mongolia', 'Montenegro', 'Morocco', 'Mozambique', 'Namibia', 'Nepal', 'Netherlands', 'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'North Macedonia', 'Norway', 'Oman', 'Pakistan', 'Palau', 'Panama', 'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Poland', 'Portugal', 'Qatar', 'Romania', 'Russia', 'Rwanda', 'Saint Kitts and Nevis', 'Saint Lucia', 'Saint Vincent and the Grenadines', 'Samoa', 'San Marino', 'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia', 'Seychelles', 'Sierra Leone', 'Singapore', 'Slovakia', 'Slovenia', 'Solomon Islands', 'Somalia', 'South Africa', 'South Sudan', 'Spain', 'Sri Lanka', 'Sudan', 'Summer Olympics 2020', 'Suriname', 'Sweden', 'Switzerland', 'Syria', 'Taiwan*', 'Tajikistan', 'Tanzania', 'Thailand', 'Timor-Leste', 'Togo', 'Trinidad and Tobago', 'Tunisia', 'Turkey', 'US', 'Uganda', 'Ukraine', 'United Arab Emirates', 'United Kingdom', 'Uruguay', 'Uzbekistan', 'Vanuatu', 'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen', 'Zambia', 'Zimbabwe']

Merge confirmed cases, deaths and recoveries into one DataFrame (Hint: you will need to merge on these 5 columns: ['Province/State', 'Country/Region', 'Date', 'Lat', 'Long'])

In [26]:
df_case_death = pd.merge(df_cases, df_death)
print(len(df_case_death))
df_case_death.head()

171585

,Province/State,Country/Region,Lat,Long,Date,Confirmed,Deaths
0,NaN,Afghanistan,33.93911,67.709953,1/22/2020,0,0
1,NaN,Albania,41.15330,20.168300,1/22/2020,0,0
2,NaN,Algeria,28.03390,1.659600,1/22/2020,0,0
3,NaN,Andorra,42.50630,1.521800,1/22/2020,0,0
4,NaN,Angola,-11.20270,17.873900,1/22/2020,0,0

In [33]:
df_case_death_recovery = pd.merge(df_case_death, df_recovery)
print(len(df_case_death_recovery))
df_case_death_recovery.head()

158670

,Province/State,Country/Region,Lat,Long,Date,Confirmed,Deaths,Recovered
0,NaN,Afghanistan,33.93911,67.709953,1/22/2020,0,0,0
1,NaN,Albania,41.15330,20.168300,1/22/2020,0,0,0
2,NaN,Algeria,28.03390,1.659600,1/22/2020,0,0,0
3,NaN,Andorra,42.50630,1.521800,1/22/2020,0,0,0
4,NaN,Angola,-11.20270,17.873900,1/22/2020,0,0,0

Create a new DataFrame from this merged data for just the latest date (Date equal to '9/27/2021')

In [37]:
con = df_case_death_recovery['Date'] == '9/27/2021' # construct a filtering condition
df_9272021 = df_case_death_recovery.loc[con,:] #.loc is a mthod used to index rows and columns in a dataframe; here it means row is the one given by 'con' and all the columns (rep by ":")
df_9272021.head()

,Province/State,Country/Region,Lat,Long,Date,Confirmed,Deaths,Recovered
158412,NaN,Afghanistan,33.93911,67.709953,9/27/2021,155072,7200,0
158413,NaN,Albania,41.15330,20.168300,9/27/2021,168188,2653,0
158414,NaN,Algeria,28.03390,1.659600,9/27/2021,202877,5786,0
158415,NaN,Andorra,42.50630,1.521800,9/27/2021,15189,130,0
158416,NaN,Angola,-11.20270,17.873900,9/27/2021,55583,1513,0

Print the top 5 Countries by deaths on the latest date (Hint: look up sort_values()). Display just the "Province/State", "Country/Region", and "Deaths" columns.

In [39]:
# calculate the sum of the death in each country or region
series_death_by_country = df_9272021.groupby(["Country/Region"])['Deaths'].sum()
# create a dataframe with the columns of 'Country/Region' and 'SumOfDeath'
df_sumOfCovidDeathByCountry = series_death_by_country.reset_index(name='SumOfDeath')
# Output the first five rows to check whether the codes work well
df_sumOfCovidDeathByCountry.head()

  Country/Region  SumOfDeath
0    Afghanistan        7200
1        Albania        2653
2        Algeria        5786
3        Andorra         130
4         Angola        1513

In [40]:
# based on the column of 'SumOfDeath', sort the dataframe 'df_sumOfCovidDeathByCountry'
df_sumOfCovidDeathByCountry = df_sumOfCovidDeathByCountry.sort_values(['SumOfDeath'],ascending=False)
# Output the first five rows to check whether the codes work well
df_sumOfCovidDeathByCountry.head(5)

    Country/Region  SumOfDeath
177             US      690426
23          Brazil      594653
78           India      447373
114         Mexico      275676
142         Russia      201015

In [41]:
# take out the top 5 countries by the sum of deaths
top5Countries = df_sumOfCovidDeathByCountry.head(5)['Country/Region']
top5Countries

177        US
23     Brazil
78      India
114    Mexico
142    Russia
Name: Country/Region, dtype: object

In [42]:
# convert the object 'top5Countries' to a list
con = [i for i in top5Countries]
# construct a filtering condition
idx_top5 = [i in con for i in df_9272021['Country/Region']]
#  print the top 5 countries by deaths on the '1/22/2020'
cols = ["Province/State", "Country/Region", "Deaths"]
df_top5 = df_9272021.loc[idx_top5,cols]
df_top5.head()

       Province/State Country/Region  Deaths
158442            NaN         Brazil  594653
158541            NaN          India  447373
158577            NaN         Mexico  275676
158610            NaN         Russia  201015
158645            NaN             US  690426

## Just Grads

Make a new DataFrame of the countries with the top 25 confirmed cases on the latest date.

In [45]:
# obtain (slice) the data on the latest data (9/27/2021)
con = df_cases['Date'] == '9/27/2021'
df_cases_927 = df_cases.loc[con,:]
df_cases_927.head()

,Province/State,Country/Region,Lat,Long,Date,Confirmed
171306,NaN,Afghanistan,33.93911,67.709953,9/27/2021,155072
171307,NaN,Albania,41.15330,20.168300,9/27/2021,168188
171308,NaN,Algeria,28.03390,1.659600,9/27/2021,202877
171309,NaN,Andorra,42.50630,1.521800,9/27/2021,15189
171310,NaN,Angola,-11.20270,17.873900,9/27/2021,55583

In [47]:
# group by country
# calculate the sum of the death in each country or region
series_confirm_by_country = df_cases_927.groupby(["Country/Region"])['Confirmed'].sum()
# create a dataframe with the columns of 'Country/Region' and 'SumOfDeath'
df_sumOfCovidConfirmByCountry = series_confirm_by_country.reset_index(name='SumOfConfirm')
# Output the first five rows to check whether the codes work well
df_sumOfCovidConfirmByCountry.head()

  Country/Region  SumOfConfirm
0    Afghanistan        155072
1        Albania        168188
2        Algeria        202877
3        Andorra         15189
4         Angola         55583

In [48]:
# based on the column of 'SumOfConfirm', sort the dataframe 'df_sumOfCovidConfirmByCountry'
df_sumOfCovidConfirmByCountry = df_sumOfCovidConfirmByCountry.sort_values(['SumOfConfirm'],ascending=False)
# Output the first 25 rows to check whether the codes work well
df_sumOfCovidConfirmByCountry.head(25)

     Country/Region  SumOfConfirm
181              US      43116442
79            India      33697581
23           Brazil      21366395
185  United Kingdom       7737941
144          Russia       7334843
62           France       7087110
180          Turkey       7066658
81             Iran       5547990
6         Argentina       5251940
37         Colombia       4952690
164           Spain       4951640
85            Italy       4662087
80        Indonesia       4209403
66          Germany       4209098
115          Mexico       3635807
140          Poland       2903655
162    South Africa       2897521
183         Ukraine       2503710
139     Philippines       2490858
108        Malaysia       2209194
138            Peru       2173354
125     Netherlands       2035980
82             Iraq       1996214
87            Japan       1696971
46          Czechia       1689620

In [49]:
# create a new dataframe named df_top25Countries_confirm_cases
df_top25Countries_confirm_cases = df_sumOfCovidConfirmByCountry.head(25)
# use type to check whehter its type is DataFrame or not
type(df_top25Countries_confirm_cases)

pandas.core.frame.DataFrame

Find the top 10 countries with the highest overall fatality rate of confirmed cases (total deaths divided by total cases)

In [52]:
# merge the Covid confirmed cases and Covid death cases into a dataframe
df_case_death = pd.merge(df_cases, df_death)
# calculate the number of confirmed cases and deaths in each country
series_confirm_by_country = df_case_death.groupby(["Country/Region"])['Confirmed'].sum() #total cases
series_death_by_country = df_case_death.groupby(["Country/Region"])['Deaths'].sum() #total deaths
# calculate the fatality rate 
series_fatalityRatio = series_death_by_country/series_confirm_by_country #total deaths divided by total cases
# convert series_fatalityRatio to a dataframe
df_fatalityRatio = series_fatalityRatio.reset_index(name='Rate')
# sort the dataframe by 'Rate'
df_fatalityRatio =df_fatalityRatio.sort_values(['Rate'],ascending=False)
# Find the top 10
df_fatalityRatio.head(10)

    Country/Region      Rate
105     MS Zaandam  0.221860
192          Yemen  0.220983
188        Vanuatu  0.179775
138           Peru  0.095858
115         Mexico  0.089402
166          Sudan  0.068118
171          Syria  0.067983
52         Ecuador  0.059362
53           Egypt  0.056915
36           China  0.048390

In [53]:
# Find the top 10 countries by calling its attribute 'index'
top10Countries = [i for i in df_fatalityRatio.head(10)['Country/Region']]
top10Countries

['MS Zaandam',
 'Yemen',
 'Vanuatu',
 'Peru',
 'Mexico',
 'Sudan',
 'Syria',
 'Ecuador',
 'Egypt',
 'China']

Of the top 25 countries on the latest data from above, calculate the difference in their monthly total confirmed cases for September and August 2021 and sort by this difference.

In [54]:
#create a list to store the top 25 countries
top25Countries = [i for i in df_top25Countries_confirm_cases['Country/Region']]
top25Countries

['US',
 'India',
 'Brazil',
 'United Kingdom',
 'Russia',
 'France',
 'Turkey',
 'Iran',
 'Argentina',
 'Colombia',
 'Spain',
 'Italy',
 'Indonesia',
 'Germany',
 'Mexico',
 'Poland',
 'South Africa',
 'Ukraine',
 'Philippines',
 'Malaysia',
 'Peru',
 'Netherlands',
 'Iraq',
 'Japan',
 'Czechia']

In [56]:
# add a new column 'Month' in the confirmed cases dataframe
df_cases['Month'] = [i[0] for i in df_cases['Date']]
df_cases.head()

,Province/State,Country/Region,Lat,Long,Date,Confirmed,Month
0,NaN,Afghanistan,33.93911,67.709953,1/22/2020,0,1
1,NaN,Albania,41.15330,20.168300,1/22/2020,0,1
2,NaN,Algeria,28.03390,1.659600,1/22/2020,0,1
3,NaN,Andorra,42.50630,1.521800,1/22/2020,0,1
4,NaN,Angola,-11.20270,17.873900,1/22/2020,0,1

In [58]:
#add a new column to store the date whose type is 'DateTime'
# in order to use the methods of 'DateTime' to construct filtering conditions.
df_cases['Time'] = pd.to_datetime(df_cases['Date'])
df_cases.head()

,Province/State,Country/Region,Lat,Long,Date,Confirmed,Month,Time
0,NaN,Afghanistan,33.93911,67.709953,1/22/2020,0,1,2020-01-22
1,NaN,Albania,41.15330,20.168300,1/22/2020,0,1,2020-01-22
2,NaN,Algeria,28.03390,1.659600,1/22/2020,0,1,2020-01-22
3,NaN,Andorra,42.50630,1.521800,1/22/2020,0,1,2020-01-22
4,NaN,Angola,-11.20270,17.873900,1/22/2020,0,1,2020-01-22

In [59]:
# obtain the data for September and August 2021 and in the top 25 countries
start, end = '8/1/2021', '9/30/2021'
con_time   = (df_cases['Time'] >= start) & (df_cases['Time'] <= end)
con_country = [i in top25Countries for i in df_cases['Country/Region']]
# 
con = con_time & con_country


df_89 = df_cases.loc[con,:]
df_89.head()

,Province/State,Country/Region,Lat,Long,Date,Confirmed,Month,Time
155409,NaN,Argentina,-38.4161,-63.6167,8/1/2021,4935847,8,2021-08-01
155433,NaN,Brazil,-14.2350,-51.9253,8/1/2021,19938358,8,2021-08-01
155495,NaN,Colombia,4.5709,-74.2973,8/1/2021,4794414,8,2021-08-01
155504,NaN,Czechia,49.8175,15.4730,8/1/2021,1673694,8,2021-08-01
155522,French Guiana,France,3.9339,-53.1258,8/1/2021,30040,8,2021-08-01

In [60]:
# group the dataframe by 'Country/Region' and 'Month'
df_p = df_89.groupby(['Country/Region','Month'])['Confirmed'].sum().reset_index(name='Confirmed')
df_p.head()

  Country/Region Month  Confirmed
0      Argentina     8  157553999
1      Argentina     9  141133249
2         Brazil     8  631977559
3         Brazil     9  569080284
4       Colombia     8  150806745

In [61]:
# create a pivot table
pivoted = df_p.pivot_table(index=['Country/Region'],
                           columns=['Month'],
                           values='Confirmed',
                           fill_value=0)
pivoted.head()

Month                   8          9
Country/Region
Argentina       157553999  141133249
Brazil          631977559  569080284
Colombia        150806745  133183710
Czechia          51968562   45473156
France          203051314  188897782

In [62]:
# calculate the difference
pivoted['diff'] = pivoted['9'] - pivoted['8']
pivoted.head()

Month                   8          9      diff
Country/Region
Argentina       157553999  141133249 -16420750
Brazil          631977559  569080284 -62897275
Colombia        150806745  133183710 -17623035
Czechia          51968562   45473156  -6495406
France          203051314  188897782 -14153532

In [63]:
# sort by the difference
pivoted.sort_values(['diff'],ascending=False)

Month                    8           9       diff
Country/Region
Malaysia          44330803    54109418    9778615
Japan             36856360    44188515    7332155
Philippines       54767029    61025806    6258777
Iran             138294286   143627432    5333146
United Kingdom   196641953   197376716     734763
Mexico            96508398    95022456   -1485942
Iraq              55068495    52770389   -2298106
South Africa      81181402    77162890   -4018512
Netherlands       60058094    54277618   -5780476
Indonesia        118769332   112519452   -6249880
Czechia           51968562    45473156   -6495406
Turkey           188649588   181551916   -7097672
Ukraine           73089935    65727893   -7362042
Peru              66153007    58388248   -7764759
Germany          119307341   110760338   -8547003
Russia           202288961   191122450  -11166511
Poland            89453978    78174466  -11279512
Spain            145741563   132690648  -13050915
Italy            137830596   124501813  -13328783
France           203051314   188897782  -14153532
Argentina        157553999   141133249  -16420750
Colombia         150806745   133183710  -17623035
US              1149210722  1118171088  -31039634
Brazil           631977559   569080284  -62897275
India            999760992   899430495 -100330497

In [64]:
# sort by the difference
pivoted['diff'].sort_values(ascending=False)

Country/Region
Malaysia            9778615
Japan               7332155
Philippines         6258777
Iran                5333146
United Kingdom       734763
Mexico             -1485942
Iraq               -2298106
South Africa       -4018512
Netherlands        -5780476
Indonesia          -6249880
Czechia            -6495406
Turkey             -7097672
Ukraine            -7362042
Peru               -7764759
Germany            -8547003
Russia            -11166511
Poland            -11279512
Spain             -13050915
Italy             -13328783
France            -14153532
Argentina         -16420750
Colombia          -17623035
US                -31039634
Brazil            -62897275
India            -100330497
Name: diff, dtype: int64